Repository: koenswings/service-kolibritest
Catalog: old/kolibri/locale/*/LC_MESSAGES/django.po
Languages: pa

source: Unexpected exception [{}]: {}
pa: ਅਚਾਨਕ ਅਪਵਾਦ [{}]: {}

# Error report message when the allowed number of digits has been exceeded.
source: Content of cell '{}' is too long
pa: ਸੈੱਲ '{}' ਦਾ ਕੰਟੈਂਟ ਬਹੁਤ ਲੰਬਾ ਹੈ

# Error report message when the cell contains an improper data format.
source: Content of cell '{}' is not valid
pa: ਸੈੱਲ '{}' ਦਾ ਕੰਟੈਂਟ ਵੈਲਿਡ ਨਹੀਂ ਹੈ

source: Duplicated username
pa: ਡੁਪਲੀਕੇਟ ਯੂਜ਼ਰਨੇਮ

source: Username only can contain characters, numbers and underscores
pa: ਯੂਜ਼ਰਨੇਮ ਵਿੱਚ ਸਿਰਫ਼ ਅੱਖਰ, ਨੰਬਰ ਅਤੇ ਅੰਡਰਸਕੋਰ ਸ਼ਾਮਲ ਹੋ ਸਕਦੇ ਹਨ

source: The column '{}' is required
pa: ਕਾਲਮ '{}' ਲੋੜੀਂਦਾ ਹੈ

source: Mix of valid and/or invalid header labels found in first row
pa: ਪਹਿਲੀ ਰੋ ਵਿੱਚ ਮਿਲੇ ਵੈਲਿਡ ਅਤੇ/ਜਾਂ ਇਨਵੈਲਿਡ ਹੈਦਰ ਲੇਬਲਾਂ ਦਾ ਮਿਸ਼ਰਣ

source: No default facility exists. Make sure to set up a facility on the device before running this command
pa: ਕੋਈ ਡਿਫਾਲਟ ਸਹੂਲਤ ਮੌਜੂਦ ਨਹੀਂ ਹੈ। ਇਸ ਕਮਾਂਡ ਨੂੰ ਚਲਾਉਣ ਤੋਂ ਪਹਿਲਾਂ ਡਿਵਾਈਸ 'ਤੇ ਇੱਕ ਸਹੂਲਤ ਸਥਾਪਤ ਕਰਨਾ ਯਕੀਨੀ ਬਣਾਓ

source: Error trying to read csv file: {}
pa: Csv ਫਾਈਲ ਨੂੰ ਪੜ੍ਹਨ ਦੀ ਕੋਸ਼ਿਸ਼ ਵਿੱਚ ਗਲਤੀ: {}

source: Error trying to write csv file: {}
pa: Csv ਫਾਈਲ ਰਾਈਟ ਕਰਨ ਦੀ ਕੋਸ਼ਿਸ਼ ਵਿੱਚ ਗਲਤੀ: {}

source: Database ID ({})
pa: ਡਾਟਾਬੇਸ ID ({})

source: Username ({})
pa: ਯੂਜ਼ਰਨੇਮ ({})

source: Password ({})
pa: ਪਾਸਵਰਡ ({})

source: Full name ({})
pa: ਪੂਰਾ ਨਾਂਮ ({})

# CSV column header for the type of user: ADMIN, LEARNER, COACH...
source: User type ({})
pa: ਯੂਜ਼ਰ ਟਾਈਪ ({})

source: Identifier ({})
pa: ਪਛਾਣਕਰਤਾ ({})

source: Birth year ({})
pa: ਜਨਮ ਦਾ ਸਾਲ ({})

source: Gender ({})
pa: ਲਿੰਗ ({})

source: Learner enrollment ({})
pa: ਸਿਖਿਆਰਥੀ ਦਾਖਲਾ ({})

source: Coach assignment ({})
pa: ਕਲਾਸ ਅਸਾਈਨਮੈਂਟ ({})

# CSV header for the type of user: ADMIN, LEARNER, COACH...
source: User type ({})
pa: ਯੂਜ਼ਰ ਟਾਈਪ ({})

source: Learner enrollment ({})
pa: ਸਿਖਿਆਰਥੀ ਦਾਖਲਾ ({})

source: Coach assignment ({})
pa: ਕੋਚ ਅਸਾਈਨਮੈਂਟ ({})

source: Unexpected error [{}]: {}
pa: ਅਚਾਨਕ ਗਲਤੀ [{}]: {}

# Error when the command is executed in the Terminal (command prompt)
source: Value in column '{}' has too many characters
pa: ਕਾਲਮ '{}' ਦੇ ਮੁੱਲ ਵਿੱਚ ਬਹੁਤ ਸਾਰੇ ਅੱਖਰ ਹਨ

source: Value in column '{}' not valid
pa: ਕਾਲਮ '{}' ਵਿੱਚ ਮੁੱਲ ਵੈਲਿਡ ਨਹੀਂ ਹੈ

source: Username is duplicated
pa: ਯੂਜ਼ਰਨਾਮ ਡੁਪਲੀਕੇਟ ਹੈ

source: The column '{}' is required
pa: ਕਾਲਮ '{}' ਲੋੜੀਂਦਾ ਹੈ

source: Incorrect header label found in the first row
pa: ਪਹਿਲੀ ਰੋ ਵਿੱਚ ਗਲਤ ਹੈਡਰ ਲੇਬਲ ਮਿਲਿਆ

# Error when the command is executed in the Terminal (command prompt)
source: No default facility exists. Make sure to set up a facility on the device before importing users and classes
pa: ਕੋਈ ਡਿਫਾਲਟ ਸਹੂਲਤ ਮੌਜੂਦ ਨਹੀਂ ਹੈ। ਉਪਭੋਗਤਾਵਾਂ ਅਤੇ ਕਲਾਸਾਂ ਨੂੰ ਆਯਾਤ ਕਰਨ ਤੋਂ ਪਹਿਲਾਂ ਡਿਵਾਈਸ 'ਤੇ ਇੱਕ ਸਹੂਲਤ ਸਥਾਪਤ ਕਰਨਾ ਯਕੀਨੀ ਬਣਾਓ

source: The password field is required. To leave the password unchanged in existing users, insert an asterisk (*)
pa: ਪਾਸਵਰਡ ਖੇਤਰ ਲੋੜੀਂਦਾ ਹੈ। ਮੌਜੂਦਾ ਉਪਭੋਗਤਾਵਾਂ ਵਿੱਚ ਪਾਸਵਰਡ ਨੂੰ ਬਦਲਿਆ ਨਾ ਛੱਡਣ ਲਈ, ਇੱਕ ਤਾਰਾ (*) ਪਾਓ

source: Cannot update user with ID: '{}' because no user with that database ID exists in this facility
pa: ID: '{}' ਨਾਲ ਯੂਜ਼ਰ ਨੂੰ ਅੱਪਡੇਟ ਨਹੀਂ ਕੀਤਾ ਜਾ ਸਕਦਾ ਕਿਉਂਕਿ ਇਸ ਸਹੂਲਤ ਵਿੱਚ ਉਸ ਡੇਟਾਬੇਸ ID ਵਾਲਾ ਕੋਈ ਯੂਜ਼ਰ ਮੌਜੂਦ ਨਹੀਂ ਹੈ।

source: Database ID is not valid
pa: ਡਾਟਾਬੇਸ ID ਵੈਲਿਡ ਨਹੀਂ ਹੈ

source: Data syncing in progress
pa: ਡਾਟਾ ਸਿੰਕਿੰਗ ਜਾਰੀ ਹੈ

source: Do not disconnect your device from the network.
pa: ਆਪਣੀ ਡਿਵਾਈਸ ਨੂੰ ਨੈੱਟਵਰਕ ਤੋਂ ਡਿਸਕਨੈਕਟ ਨਾ ਕਰੋ।

source: Resource
pa: ਸਰੋਤ

source: The requested channel does not exist on the content server
pa: ਬੇਨਤੀ ਕੀਤਾ ਚੈਨਲ ਕੰਟੈਂਟ ਸਰਵਰ 'ਤੇ ਮੌਜੂਦ ਨਹੀਂ ਹੈ

source: Unknown format
pa: ਅਗਿਆਤ ਫਾਰਮੈਟ

source: Updating your library
pa: ਤੁਹਾਡੀ ਲਾਇਬ੍ਰੇਰੀ ਨੂੰ ਅੱਪਡੇਟ ਕੀਤਾ ਜਾ ਰਿਹਾ ਹੈ

source: Library updated
pa: ਲਾਇਬ੍ਰੇਰੀ ਅੱਪਡੇਟ ਕੀਤੀ ਗਈ

source: Library update failed
pa: ਲਾਇਬ੍ਰੇਰੀ ਅੱਪਡੇਟ ਅਸਫਲ ਰਿਹਾ

source: Language is not supported by Kolibri
pa: ਭਾਸ਼ਾ ਕੋਲਿਬਰੀ ਦੁਆਰਾ ਸਮਰਥਿਤ ਨਹੀਂ ਹੈ

source: Searching
pa: ਖੋਜ ਕੀਤੀ ਜਾ ਰਹੀ ਹੈ

source: Looking for other Kolibri devices
pa: ਹੋਰ ਕੋਲੀਬਰੀ ਡਿਵਾਈਸਾਂ ਦੀ ਭਾਲ ਕੀਤੀ ਜਾ ਰਹੀ ਹੈ

source: Facility name
pa: ਸਹੂਲਤ ਦਾ ਨਾਮ

source: Username
pa: ਯੂਜ਼ਰਨੇਮ

source: Channel id
pa: ਚੈਨਲ ਆਈ.ਡੀ

source: Channel name
pa: ਚੈਨਲ ਦਾ ਨਾਮ

source: Content id
pa: ਕੰਟੈਂਟ ਆਈ ਡੀ

source: Content title
pa: ਕੰਟੈਂਟ ਟਾਈਟਲ

# CSV column header for the time of the first interaction in the exported logs
source: Time of first interaction
pa: ਪਹਿਲੀ ਗੱਲਬਾਤ ਦਾ ਸਮਾਂ

# CSV column header for the time of the last interaction in the exported logs
source: Time of last interaction
pa: ਆਖਰੀ ਗੱਲਬਾਤ ਦਾ ਸਮਾਂ

# CSV column header for the percentage of completion in the exported logs
source: Time of completion
pa: ਪੂਰਾ ਹੋਣ ਦਾ ਸਮਾਂ

# CSV column header for the time spent in a resource in the exported logs
source: Time Spent (sec)
pa: ਸਮਾਂ ਬਿਤਾਇਆ (ਸਕਿੰਟ)

source: Progress (0-1)
pa: ਤਰੱਕੀ (0-1)

source: Content kind
pa: ਕੰਟੈਂਟ ਕਾਈਂਡ

source: Complete
pa: ਸੰਪੂਰਨ

source: Failed
pa: ਅਸਫਲ ਹੋਇਆ

source: Cancelled
pa: ਰੱਦ

source: In progress - {percent}%
pa: ਪ੍ਰਗਤੀ ਵਿੱਚ - {percent}%

source: Waiting
pa: ਉਡੀਕ ਕੀਤੀ ਜਾ ਰਹੀ ਹੈ

source: Kolibri is starting
pa: ਕੋਲੀਬਰੀ ਸ਼ੁਰੂ ਹੋ ਰਹੀ ਹੈ

source: Starting Kolibri
pa: ਕੋਲੀਬਰੀ ਸ਼ੁਰੂ ਕੀਤੀ ਜਾ ਰਹੀ ਹੈ

source: You should be automatically redirected when Kolibri is ready
pa: ਕੋਲਿਬਰੀ ਤਿਆਰ ਹੋਣ 'ਤੇ ਤੁਹਾਨੂੰ ਆਪਣੇ ਆਪ ਰੀਡਾਇਰੈਕਟ ਕੀਤਾ ਜਾਣਾ ਚਾਹੀਦਾ ਹੈ

source: If not, please ask for help in our community forums
pa: ਜੇਕਰ ਨਹੀਂ, ਤਾਂ ਕਿਰਪਾ ਕਰਕੇ ਸਾਡੇ ਭਾਈਚਾਰਕ ਫੋਰਮਾਂ ਵਿੱਚ ਮਦਦ ਮੰਗੋ

source: Refresh page
pa: ਸਫ਼ਾ ਰੀਫ੍ਰੈਸ਼ ਕਰੋ

source: Unsupported browser
pa: ਅਸਮਰਥਿਤ ਬ੍ਰਾਊਜ਼ਰ

source: Sorry, your browser version is not supported.
pa: ਮਾਫ਼ ਕਰਨਾ, ਤੁਹਾਡਾ ਬ੍ਰਾਊਜ਼ਰ ਸੰਸਕਰਣ ਸਮਰਥਿਤ ਨਹੀਂ ਹੈ।

source: To use Kolibri, we recommend using Firefox or Chrome.
pa: ਕੋਲੀਬਰੀ ਦੀ ਵਰਤੋਂ ਕਰਨ ਲਈ, ਅਸੀਂ ਫਾਇਰਫਾਕਸ ਜਾਂ ਕਰੋਮ ਵਰਤਣ ਦੀ ਸਿਫ਼ਾਰਿਸ਼ ਕਰਦੇ ਹਾਂ।

source: You can also try updating your current browser.
pa: ਤੁਸੀਂ ਆਪਣੇ ਮੌਜੂਦਾ ਬ੍ਰਾਊਜ਼ਰ ਨੂੰ ਅੱਪਡੇਟ ਕਰਨ ਦੀ ਕੋਸ਼ਿਸ਼ ਵੀ ਕਰ ਸਕਦੇ ਹੋ।

source: Kolibri
pa: ਕੋਲੀਬਰੀ

source: No appropriate redirect pages found. It is likely that Kolibri is badly configured
pa: ਕੋਈ ਢੁਕਵੇਂ ਰੀਡਾਇਰੈਕਟ ਪੰਨੇ ਨਹੀਂ ਮਿਲੇ। ਇਹ ਸੰਭਾਵਨਾ ਹੈ ਕਿ ਕੋਲੀਬਰੀ ਬੁਰੀ ਤਰ੍ਹਾਂ ਸੰਰਚਿਤ ਹੈ

source: Coach
pa: ਕੋਚ

source: Facility
pa: ਸਹੂਲਤ

source: users
pa: ਯੂਜ਼ਰ

source: Learn
pa: ਸਿੱਖੋ

source: Policies
pa: ਨੀਤੀਆਂ

source: Setup Wizard
pa: ਸੈਟਅੱਪ ਵਿਜ਼ਰਡ

source: User Profile
pa: ਯੂਜ਼ਰ ਪ੍ਰੋਫ਼ਾਈਲ

source: Account transfer in progress
pa: ਅਕਾਊਂਟ ਟ੍ਰਾਂਸਫਰ ਜਾਰੀ ਹੈ

source: Moving {learner_name} to learning facility {facility_name}
pa: {learner_name} ਨੂੰ ਸਿੱਖਣ ਦੀ ਸਹੂਲਤ {facility_name} ਵਿੱਚ ਤਬਦੀਲ ਕੀਤਾ ਜਾ ਰਿਹਾ ਹੈ
